export const dialogues = [
    '你终于来了，我的朋友。简单自我介绍一下吧，我是这所屋子的公爵，是因为加班在这里猝死的。我没想到死后灵魂竟留在人间，便动手搭建了这个密室。如果你们能通过我的考验，你们将得到我生前留下的所有财富！',
    '能来到这里的，都会计算机学科的精英，相信你一定非常了解计算机的各个领域的知识了！我相信，这个密室对你来说不会太难，其中牵涉到了计算机体系结构、数据结构、密码学、计算机网络等等的知识，还有彩蛋哦～',
    '好了好了，我就不再剧透了，好好享受解开谜题的乐趣吧！能够穿越时空在这里相遇是你我之间的缘分，那么就祝你好运。',
    '多说一句, 虚拟世界的朋友, 探索一下上方的图标，就可以掌握行动自如术。后会有期。'
]

export const riddles = [
    'CPU请求地址1011的字节和1001的字节后,此时cache两个蓝色框框内的数据是什么？',
    '对于指令 add t0 t1 t2, MemtoReg和RegWrite输出是什么?',
    '换个角度看世界或许有新的发现哦~',
    '诶呀呀,居然让你打开了我的日记,那么我考考你,我最爱吃什么？',
    '使用开放寻址法和线性探索,5,20,1,31,4 要在长度为7的哈希表中找到自己的归宿。各自需要几次无疾而终的探测呢?',
    '电脑饿了吃什么~',
    '乐谱里有个小谜语~猜一猜是什么吧~'
]

export const tips = [
    ["标记位(m-s-b),组索引(s位),块偏移(b位)"],
    ["不会有人不知道这条指令只涉及到写入寄存器吧","指令的意思是把t2的值和t1的值相加写入t0哦"],
    ["傻瓜提示：是一个报文的标志位哦~"],
    ["书里好像有个书签哦~","你知道十六进制的颜色码吗?","你学过维吉尼亚密码吗?"],
    ["看看洗手台有什么~","或许你应该去学习一下hash table"],
    ["是一个基本单位哦~"],
    ["你应该去进修五线谱乐理知识了","一个音符一个字母这么明显~看不出来吗?","留声机下面压着什么呀"],
]

export const chat = [
    "你问我是谁?哈哈我是这座城堡的公爵",
    "欢迎来到我的城堡",
    "还没有解出谜题吗~你们是想摆烂吗",
    "想让我通融通融?门都没有~或许你可以找一找windows",
]
